{
    "Welcome": "Vitajte",
    "Final task": "Záverečné zadanie",
    "Log in": "Prihlásiť sa",
    "Register": "Registrácia",
    "Log out": "Odhlásiť",
    "Forgot your password?": "Zabudnuté heslo?",
    "Password": "Heslo",
    "Remember me": "Zapamätať si ma",
    "Name": "Meno",
    "Output": "Výstup",
    "Confirm Password": "Potvrdiť heslo",
    "Already registered?": "Už máš účet?",
    "Reset Password": "Resetovať heslo",
    "Forgot your password? No problem. Just let us know your email address and we will email you a password reset link that will allow you to choose a new one.": "Zabudnuté heslo? Zadaj email, na ktorý zašleme odkaz na zmenu hesla.",
    "Confirm": "Potvrdiť",
    "Email Password Reset Link": "Poslať email s odkazom na resetovanie hesla",
    "Resend Verification Email": "Znovu poslaľ verifikačný email",
    "A new verification link has been sent to the email address you provided during registration.": "Nový verifikačný email bol zaslaný na vašu emailovú adresu.",
    "Thanks for signing up! Before getting started, could you verify your email address by clicking on the link we just emailed to you? If you didn't receive the email, we will gladly send you another.": "Registrácia úspešná - verifikačný email bol zaslaný na vašu emailovú adresu",
    "General use": "Všeobecné používanie",
    "For animation (insert only r value [f.e. 0.1])": "Pre animáciu (vkladaj iba hodnoty r [f.e. 0.1])",
    "Download CSV of logs": "Stiahnuť CSV logov",
    "Get CSV": "Stiahnuť CSV",
    "Send mail with CSV logs": "Poslať mail s CSV logmi",
    "Send mail": "Poslať mail",
    "r value...": "hodnota r...",
    "Query...": "Príkaz...",
    "Instructions page": "Stránka s inštrukciami",
    "Go to instructions": "Zobraz inštrukcie",
    "Instructions": "Inštrukcie",
    "Download PDF": "Stiahni PDF",
    "Logs page": "Stránka s logmi",
    "Logs": "Logy",
    "Start animation": "Spustiť animáciu",
    "Animation": "Animácia",
    "Graph": "Graf",
    "The webpage allows the users to work with Octave. Inputting Octave commands into the": "Stránka umožňuje pracovať s Octave programom. Je možné zadať do textového poľa",
    "textbox, allows the user to run standard Octave commands, returning the program's output": "vstup, ktorý by ste normálne zadali do Octave. To vám vráti výstup programu",
    "Clicking on": "Ďalej kliknutím na tlačítko",
    "starts a predefined Octave program, and its' output is shown as an animation. The output is also graphed below": "sa spustí preddefinovaný Octave príklad a jeho výstup sa zobrazí nižšie ako animácia. Pod animáciou je aj graf výstupu",
    "On the Logs page the user can view program logs, download them in CSV format, or send them via e-mail": "Na podstránke logy je možné si stiahnuť logy vo formáte CSV, poprípade ich poslať na preddefinovaný email. Alebo je možné si ich pozrieť priamo na stránke",
    "executes an Octave command returning its' output": "vykoná zadaný príkaz v octave a vráti výstupné dáta",
    "runs the predefined Octave animation program, returning the x,y,t values": "vykoná preddefinovaný príkaz pre animáciu a vráti x,y,t",
    "downloads the logs in CSV format": "stiahnutie logov v CSV formáte",
    "sends the logs to a preconfigured e-mail adress": "pošle mail s logmi na nakonfigurovaný email",
    "The following endpoints of our Octave API are available for developers": "Pre developerov tu sú endpointy nášho Octave API",
    "url param or in request body": "url parameter alebo môže byť posielaný spolu s query ako súčasť tela požiadavky",
    "Request body": "Telo požiadavky",
    "Url params": "Url parametre",
    "optional and between -0.2 and 0.2": "voliteľný parameter a hodnoty musia byť medzi -0.2 a 0.2",
    "Documentation": "Dokumentácia",
    "Frontend of the application": "Frontend aplikácie",
    "Main page": "Hlavná stránka",
    "PDF with instructions for api usage": "PDF s inštrukciami pre používanie API",
    "Instructions for api usage": "Inštrukcie pre používanie API",
    "Documentation page": "Stránka dokumentácie",
    "View, download and send email of logs": "Prezeranie, sťahovanie a posielanie logov emailom",
    "Backend of the application (API urls)": "Backend aplikácie (API url adresy)",
    "Exec given query in octave cli - requires: apikey, query": "Spúštanie zadaného príkazu v octave cli a vrátenie výstupu z octave-cli - potrebuje: apikey, query",
    "Exec predefined query in octave cli - requires: apikey, rValue(optional)": "Spúštanie preddefinovaného príkazu v octave cli a vrátenie výstupu z octave-cli - potrebuje: apikey, query",
    "Download CSV of logs - requires: apikey": "Sťahovanie CSV logov - potrebuje: apikey",
    "Send mail of logs to predefined email address - requires: apikey": "Posielanie emailov logov na preddefinovanú adresu - potrebuje: apikey",
    "Tasks distribution": "Rozdelenie práce",
    "Bilingualism": "Dvojjazyčnosť",
    "API for CAS secured by API key": "API ku CAS zabezpečené API kľúčom alebo tokenom",
    "Graph synchronized with animation": "Graf synchronizovaný s animáciou",
    "Api verification using form - specified in task 5": "Overenie API cez formulár v rozsahu špecifikovanom v úlohe 5",
    "Logs and export CSV + sending of emails":"Logovanie a export do csv + odoslanie mailu",
    "export API description to PDF": "Export popisu API do pdf",
    "Synchronized tracking of experiments": "Synchrónne sledovanie experimentovania",
    "Not finished": "Nedokončené",
    "Docker": "Docker balíček",
    "Git usage": "Používanie verzionovacieho systému všetkými členmi tímu",
    "Finalization of the application": "Finalizácia aplikácie"
}